"""
Написать функцию biggest_dict, которая принимает словарь (необязательный аргумент)
и неограниченное количество аргументов вида ключ-значение.

Если был передан словарь, то одна добавляет к нему все аргументы ключ-значение.
Если не был передан словарь, то создает новый из аргументов ключ-значение она составляет
словарь и возвращает словарь
"""


def biggest_dict(dict_1: dict, **kwargs):
    if type(dict_1) == dict:
        dict_1.update(kwargs)
        return dict_1
    else:
        dict_1 = dict(**kwargs)
        return dict_1
